thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_ioc.h
/******************************************************************************
 *  Filename:       hw_ioc_h
 *  Revised:        2017-01-31 09:37:48 +0100 (Tue, 31 Jan 2017)
 *  Revision:       48345
 *
 * Copyright (c) 2015 - 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1) Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2) Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3) Neither the name of the ORGANIZATION nor the names of its contributors may
 *    be used to endorse or promote products derived from this software without
 *    specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************/

#ifndef __HW_IOC_H__
#define __HW_IOC_H__

//*****************************************************************************
//
// This section defines the register offsets of
// IOC component
//
//*****************************************************************************
// Configuration of DIO0
#define IOC_O_IOCFG0 0x00000000

// Configuration of DIO1
#define IOC_O_IOCFG1 0x00000004

// Configuration of DIO2
#define IOC_O_IOCFG2 0x00000008

// Configuration of DIO3
#define IOC_O_IOCFG3 0x0000000C

// Configuration of DIO4
#define IOC_O_IOCFG4 0x00000010

// Configuration of DIO5
#define IOC_O_IOCFG5 0x00000014

// Configuration of DIO6
#define IOC_O_IOCFG6 0x00000018

// Configuration of DIO7
#define IOC_O_IOCFG7 0x0000001C

// Configuration of DIO8
#define IOC_O_IOCFG8 0x00000020

// Configuration of DIO9
#define IOC_O_IOCFG9 0x00000024

// Configuration of DIO10
#define IOC_O_IOCFG10 0x00000028

// Configuration of DIO11
#define IOC_O_IOCFG11 0x0000002C

// Configuration of DIO12
#define IOC_O_IOCFG12 0x00000030

// Configuration of DIO13
#define IOC_O_IOCFG13 0x00000034

// Configuration of DIO14
#define IOC_O_IOCFG14 0x00000038

// Configuration of DIO15
#define IOC_O_IOCFG15 0x0000003C

// Configuration of DIO16
#define IOC_O_IOCFG16 0x00000040

// Configuration of DIO17
#define IOC_O_IOCFG17 0x00000044

// Configuration of DIO18
#define IOC_O_IOCFG18 0x00000048

// Configuration of DIO19
#define IOC_O_IOCFG19 0x0000004C

// Configuration of DIO20
#define IOC_O_IOCFG20 0x00000050

// Configuration of DIO21
#define IOC_O_IOCFG21 0x00000054

// Configuration of DIO22
#define IOC_O_IOCFG22 0x00000058

// Configuration of DIO23
#define IOC_O_IOCFG23 0x0000005C

// Configuration of DIO24
#define IOC_O_IOCFG24 0x00000060

// Configuration of DIO25
#define IOC_O_IOCFG25 0x00000064

// Configuration of DIO26
#define IOC_O_IOCFG26 0x00000068

// Configuration of DIO27
#define IOC_O_IOCFG27 0x0000006C

// Configuration of DIO28
#define IOC_O_IOCFG28 0x00000070

// Configuration of DIO29
#define IOC_O_IOCFG29 0x00000074

// Configuration of DIO30
#define IOC_O_IOCFG30 0x00000078

// Configuration of DIO31
#define IOC_O_IOCFG31 0x0000007C

//*****************************************************************************
//
// Register: IOC_O_IOCFG0
//
//*****************************************************************************
// Field:    [30] HYST_EN
//
// 0: Input hysteresis disable
// 1: Input hysteresis enable
#define IOC_IOCFG0_HYST_EN 0x40000000
#define IOC_IOCFG0_HYST_EN_BITN 30
#define IOC_IOCFG0_HYST_EN_M 0x40000000
#define IOC_IOCFG0_HYST_EN_S 30

// Field:    [29] IE
//
// 0: Input disabled
// 1: Input enabled
//
// Note: If IO is configured for AUX  ie. PORT_ID = 0x08, the enable will be
// ignored.
#define IOC_IOCFG0_IE 0x20000000
#define IOC_IOCFG0_IE_BITN 29
#define IOC_IOCFG0_IE_M 0x20000000
#define IOC_IOCFG0_IE_S 29

// Field: [28:27] WU_CFG
//
// If DIO is configured GPIO or non-AON peripheral signals, i.e. PORT_ID 0x00
// or >0x08:
//
// 00: No wake-up
// 01: No wake-up
// 10: Wakes up from shutdown if this pad is going low.
// 11: Wakes up from shutdown if this pad is going high.
//
// If IO is configured for AON peripheral signals or AUX  ie. PORT_ID
// 0x01-0x08, this register only sets wakeup enable or not.
//
// 00, 01: Wakeup disabled
// 10, 11: Wakeup enabled
//
// Polarity is controlled from AON registers.
//
// Note:When the MSB is set, the IOC will deactivate the output enable for the
// DIO.
#define IOC_IOCFG0_WU_CFG_W 2
#define IOC_IOCFG0_WU_CFG_M 0x18000000
#define IOC_IOCFG0_WU_CFG_S 27

// Field: [26:24] IOMODE
//
// IO Mode
// N/A for IO configured for AON periph. signals and AUX  ie. PORT_ID 0x01-0x08
// AUX has its own open_source/drain configuration.
//
// 0x2: Reserved. Undefined behavior.
// 0x3: Reserved. Undefined behavior.
// ENUMs:
// OPENSRC_INV              Open Source
//                          Inverted input/output
// OPENSRC                  Open Source
//                          Normal input / outut
// OPENDR_INV               Open Drain
//                          Inverted input / output
// OPENDR                   Open Drain,
//                          Normal input / output
// INV                      Inverted input / ouput
// NORMAL                   Normal input / output
#define IOC_IOCFG0_IOMODE_W 3
#define IOC_IOCFG0_IOMODE_M 0x07000000
#define IOC_IOCFG0_IOMODE_S 24
#define IOC_IOCFG0_IOMODE_OPENSRC_INV 0x07000000
#define IOC_IOCFG0_IOMODE_OPENSRC 0x06000000
#define IOC_IOCFG0_IOMODE_OPENDR_INV 0x05000000
#define IOC_IOCFG0_IOMODE_OPENDR 0x04000000
#define IOC_IOCFG0_IOMODE_INV 0x01000000
#define IOC_IOCFG0_IOMODE_NORMAL 0x00000000

