thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_ioc.h
// Field:    [18] EDGE_IRQ_EN
//
// 0: No interrupt generation
// 1: Enable interrupt generation for this IO (Only effective if EDGE_DET is
// enabled)
#define IOC_IOCFG0_EDGE_IRQ_EN 0x00040000
#define IOC_IOCFG0_EDGE_IRQ_EN_BITN 18
#define IOC_IOCFG0_EDGE_IRQ_EN_M 0x00040000
#define IOC_IOCFG0_EDGE_IRQ_EN_S 18

// Field: [17:16] EDGE_DET
//
// Enable generation of edge detection events on this IO
// ENUMs:
// BOTH                     Positive and negative edge detection
// POS                      Positive edge detection
// NEG                      Negative edge detection
// NONE                     No edge detection
#define IOC_IOCFG0_EDGE_DET_W 2
#define IOC_IOCFG0_EDGE_DET_M 0x00030000
#define IOC_IOCFG0_EDGE_DET_S 16
#define IOC_IOCFG0_EDGE_DET_BOTH 0x00030000
#define IOC_IOCFG0_EDGE_DET_POS 0x00020000
#define IOC_IOCFG0_EDGE_DET_NEG 0x00010000
#define IOC_IOCFG0_EDGE_DET_NONE 0x00000000

// Field: [14:13] PULL_CTL
//
// Pull control
// ENUMs:
// DIS                      No pull
// UP                       Pull up
// DWN                      Pull down
#define IOC_IOCFG0_PULL_CTL_W 2
#define IOC_IOCFG0_PULL_CTL_M 0x00006000
#define IOC_IOCFG0_PULL_CTL_S 13
#define IOC_IOCFG0_PULL_CTL_DIS 0x00006000
#define IOC_IOCFG0_PULL_CTL_UP 0x00004000
#define IOC_IOCFG0_PULL_CTL_DWN 0x00002000

// Field:    [12] SLEW_RED
//
// 0: Normal slew rate
// 1: Enables reduced slew rate in output driver.
#define IOC_IOCFG0_SLEW_RED 0x00001000
#define IOC_IOCFG0_SLEW_RED_BITN 12
#define IOC_IOCFG0_SLEW_RED_M 0x00001000
#define IOC_IOCFG0_SLEW_RED_S 12

// Field: [11:10] IOCURR
//
// Selects IO current mode of this IO.
// ENUMs:
// 4_8MA                    Extended-Current (EC) mode: Min 8 mA for double
//                          drive strength IOs (min 4 mA for normal IOs)
//                          when IOSTR is set to AUTO
// 4MA                      High-Current (HC) mode: Min 4 mA when IOSTR is set
//                          to AUTO
// 2MA                      Low-Current (LC) mode: Min 2 mA when IOSTR is set
//                          to AUTO
#define IOC_IOCFG0_IOCURR_W 2
#define IOC_IOCFG0_IOCURR_M 0x00000C00
#define IOC_IOCFG0_IOCURR_S 10
#define IOC_IOCFG0_IOCURR_4_8MA 0x00000800
#define IOC_IOCFG0_IOCURR_4MA 0x00000400
#define IOC_IOCFG0_IOCURR_2MA 0x00000000

// Field:   [9:8] IOSTR
//
// Select source for drive strength control of this IO.
// This setting controls the drive strength of the Low-Current (LC) mode.
// Higher drive strength can be selected in IOCURR
// ENUMs:
// MAX                      Maximum drive strength, controlled by
//                          AON_IOC:IOSTRMAX (min 2 mA @1.8V with default
//                          values)
// MED                      Medium drive strength, controlled by
//                          AON_IOC:IOSTRMED (min 2 mA @2.5V with default
//                          values)
// MIN                      Minimum drive strength, controlled by
//                          AON_IOC:IOSTRMIN (min 2 mA @3.3V with default
//                          values)
// AUTO                     Automatic drive strength, controlled by AON BATMON
//                          based on battery voltage. (min 2 mA @VDDS)
#define IOC_IOCFG0_IOSTR_W 2
#define IOC_IOCFG0_IOSTR_M 0x00000300
#define IOC_IOCFG0_IOSTR_S 8
#define IOC_IOCFG0_IOSTR_MAX 0x00000300
#define IOC_IOCFG0_IOSTR_MED 0x00000200
#define IOC_IOCFG0_IOSTR_MIN 0x00000100
#define IOC_IOCFG0_IOSTR_AUTO 0x00000000

// Field:   [5:0] PORT_ID
//
// Selects usage for DIO0
// ENUMs:
// RFC_SMI_CL_IN            RF Core SMI Command Link In
// RFC_SMI_CL_OUT           RF Core SMI Command Link Out
// RFC_SMI_DL_IN            RF Core SMI Data Link In
// RFC_SMI_DL_OUT           RF Core SMI Data Link Out
// RFC_GPI1                 RF Core Data In 1
// RFC_GPI0                 RF Core Data In 0
// RFC_GPO3                 RF Core Data Out 3
// RFC_GPO2                 RF Core Data Out 2
// RFC_GPO1                 RF Core Data Out 1
// RFC_GPO0                 RF Core Data Out 0
// RFC_TRC                  RF Core Trace
// I2S_MCLK                 I2S MCLK
// I2S_BCLK                 I2S BCLK
// I2S_WCLK                 I2S WCLK
// I2S_AD1                  I2S Data 1
// I2S_AD0                  I2S Data 0
// SSI1_CLK                 SSI1 CLK
// SSI1_FSS                 SSI1 FSS
// SSI1_TX                  SSI1 TX
// SSI1_RX                  SSI1 RX
// CPU_SWV                  CPU SWV
// PORT_EVENT7              PORT EVENT 7
//                          Can be used as a general
//                          purpose IO event by selecting it via registers
//                          in the EVENT module, e.g.
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          etc
// PORT_EVENT6              PORT EVENT 6
//                          Can be used as a general
//                          purpose IO event by selecting it via registers
//                          in the EVENT module, e.g.
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          etc
// PORT_EVENT5              PORT EVENT 5
//                          Can be used as a general
//                          purpose IO event by selecting it via registers
//                          in the EVENT module, e.g.
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          etc
// PORT_EVENT4              PORT EVENT 4
//                          Can be used as a general
//                          purpose IO event by selecting it via registers
//                          in the EVENT module, e.g.
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          etc
// PORT_EVENT3              PORT EVENT 3
//                          Can be used as a general
//                          purpose IO event by selecting it via registers
//                          in the EVENT module, e.g.
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          etc
// PORT_EVENT2              PORT EVENT 2
//                          Can be used as a general
//                          purpose IO event by selecting it via registers
//                          in the EVENT module, e.g.
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          etc
// PORT_EVENT1              PORT EVENT 1
//                          Can be used as a general
//                          purpose IO event by selecting it via registers
//                          in the EVENT module, e.g.
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          etc
// PORT_EVENT0              PORT EVENT 0
//                          Can be used as a general
//                          purpose IO event by selecting it via registers
//                          in the EVENT module, e.g.
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          etc
// UART0_RTS                UART0 RTS
// UART0_CTS                UART0 CTS
// UART0_TX                 UART0 TX
// UART0_RX                 UART0 RX
// I2C_MSSCL                I2C Clock
// I2C_MSSDA                I2C Data
// SSI0_CLK                 SSI0 CLK
// SSI0_FSS                 SSI0 FSS
// SSI0_TX                  SSI0 TX
// SSI0_RX                  SSI0 RX
// AUX_IO                   AUX IO
// AON_CLK32K               AON 32 KHz clock (SCLK_LF)
// GPIO                     General Purpose IO
#define IOC_IOCFG0_PORT_ID_W 6
#define IOC_IOCFG0_PORT_ID_M 0x0000003F
#define IOC_IOCFG0_PORT_ID_S 0
#define IOC_IOCFG0_PORT_ID_RFC_SMI_CL_IN 0x00000038
#define IOC_IOCFG0_PORT_ID_RFC_SMI_CL_OUT 0x00000037
#define IOC_IOCFG0_PORT_ID_RFC_SMI_DL_IN 0x00000036
#define IOC_IOCFG0_PORT_ID_RFC_SMI_DL_OUT 0x00000035
#define IOC_IOCFG0_PORT_ID_RFC_GPI1 0x00000034
#define IOC_IOCFG0_PORT_ID_RFC_GPI0 0x00000033
#define IOC_IOCFG0_PORT_ID_RFC_GPO3 0x00000032
#define IOC_IOCFG0_PORT_ID_RFC_GPO2 0x00000031
#define IOC_IOCFG0_PORT_ID_RFC_GPO1 0x00000030
#define IOC_IOCFG0_PORT_ID_RFC_GPO0 0x0000002F
#define IOC_IOCFG0_PORT_ID_RFC_TRC 0x0000002E
#define IOC_IOCFG0_PORT_ID_I2S_MCLK 0x00000029
#define IOC_IOCFG0_PORT_ID_I2S_BCLK 0x00000028
#define IOC_IOCFG0_PORT_ID_I2S_WCLK 0x00000027
#define IOC_IOCFG0_PORT_ID_I2S_AD1 0x00000026
#define IOC_IOCFG0_PORT_ID_I2S_AD0 0x00000025
#define IOC_IOCFG0_PORT_ID_SSI1_CLK 0x00000024
#define IOC_IOCFG0_PORT_ID_SSI1_FSS 0x00000023
#define IOC_IOCFG0_PORT_ID_SSI1_TX 0x00000022
#define IOC_IOCFG0_PORT_ID_SSI1_RX 0x00000021
#define IOC_IOCFG0_PORT_ID_CPU_SWV 0x00000020
#define IOC_IOCFG0_PORT_ID_PORT_EVENT7 0x0000001E
#define IOC_IOCFG0_PORT_ID_PORT_EVENT6 0x0000001D
#define IOC_IOCFG0_PORT_ID_PORT_EVENT5 0x0000001C
#define IOC_IOCFG0_PORT_ID_PORT_EVENT4 0x0000001B
#define IOC_IOCFG0_PORT_ID_PORT_EVENT3 0x0000001A
#define IOC_IOCFG0_PORT_ID_PORT_EVENT2 0x00000019
#define IOC_IOCFG0_PORT_ID_PORT_EVENT1 0x00000018
#define IOC_IOCFG0_PORT_ID_PORT_EVENT0 0x00000017
#define IOC_IOCFG0_PORT_ID_UART0_RTS 0x00000012
#define IOC_IOCFG0_PORT_ID_UART0_CTS 0x00000011
#define IOC_IOCFG0_PORT_ID_UART0_TX 0x00000010
#define IOC_IOCFG0_PORT_ID_UART0_RX 0x0000000F
#define IOC_IOCFG0_PORT_ID_I2C_MSSCL 0x0000000E
#define IOC_IOCFG0_PORT_ID_I2C_MSSDA 0x0000000D
#define IOC_IOCFG0_PORT_ID_SSI0_CLK 0x0000000C
#define IOC_IOCFG0_PORT_ID_SSI0_FSS 0x0000000B
#define IOC_IOCFG0_PORT_ID_SSI0_TX 0x0000000A
#define IOC_IOCFG0_PORT_ID_SSI0_RX 0x00000009
#define IOC_IOCFG0_PORT_ID_AUX_IO 0x00000008
#define IOC_IOCFG0_PORT_ID_AON_CLK32K 0x00000007
#define IOC_IOCFG0_PORT_ID_GPIO 0x00000000

//*****************************************************************************
//
// Register: IOC_O_IOCFG1
//
//*****************************************************************************
// Field:    [30] HYST_EN
//
// 0: Input hysteresis disable
// 1: Input hysteresis enable
#define IOC_IOCFG1_HYST_EN 0x40000000
#define IOC_IOCFG1_HYST_EN_BITN 30
#define IOC_IOCFG1_HYST_EN_M 0x40000000
#define IOC_IOCFG1_HYST_EN_S 30

// Field:    [29] IE
//
// 0: Input disabled
// 1: Input enabled
//
// Note: If IO is configured for AUX  ie. PORT_ID = 0x08, the enable will be
// ignored.
#define IOC_IOCFG1_IE 0x20000000
#define IOC_IOCFG1_IE_BITN 29
#define IOC_IOCFG1_IE_M 0x20000000
#define IOC_IOCFG1_IE_S 29

